package random

func MessageWithCondition(isDirty, isOverweight, isBroken bool, characterID int) string {
	var score int
	if isBroken {
		score |= 1
	}
	if isOverweight {
		score |= 2
	}
	if isDirty {
		score |= 4
	}

	return message[characterID][score]
}

var message = [25][8]string{
	{"わ、わるくないね！", "い、痛くないから！", "重くないってば！", "…流石に結構痛いかも", "この程度の汚れヘーキだって！", "…痛いしベタつく", "ベタつくし重いし…", "もう無理…"},
	{"いいよ！", "あれ、壊れてる！？", "おや、重たい！？", "あれ、どいて直してもらわないとまずい？", "気づいたら汚れてた！", "おや、直して掃除してもらわないといけない？", "あー、どいて掃除してもらわないと！", "気がついたら全部ダメだった！"},
	{"い、いい感じだよ...", "な、直してもらえますか...?", "ど、どいてもらえますか...?", "このままだと壊れちゃうかも、どいて直して！", "べたべたしてる…", "汚れた壊れたまま...捨てられちゃうの...?", "", "改善せず捨てられちゃうの...?"},
	{"いい感じです。", "直していただけますか？", "どいていただけますか？", "どいて直していただけますか？", "キレイにしていただけますか？", "直してキレイにしていただけますか？", "どいてから掃除していただけますか？", "改善していただけますか？"},
	{"いい感じです〜", "壊れちゃいました〜", "疲れちゃいました〜", "壊れちゃってるし疲れましたね〜", "汚れちゃいました〜", "壊れちゃったし汚れてますね〜", "汚れてるし疲れました〜", "なんとかしてくれると嬉しいです〜"},
	{"いい感じです。", "壊れています。", "重たいです。", "重たいし壊れています。", "汚れています。", "汚れているし壊れています。", "汚れているし重たいです。", "改善を希望します。"},
	{"これからもがんばっていきましょう！", "直るまで耐えます！", "重いけどがんばります！", "重さで壊れないようにがんばります！", "汚いけど我慢です！", "掃除と修理が終わるまで耐えます！", "重いけど掃除まで耐えます！", "さすがにがんばれません..."},
	{"いいんじゃない？", "直してほしいな〜", "あ、重いしどいてくれる？", "あ、どいた後で直してくれる？", "掃除して欲しい気分！", "直した後拭いてくれないかな〜", "どいた後拭いてくれないかな〜", "はやくなんとかしてほしいな〜"},
	{"これからもいっしょだよ！", "はやくなおして...", "おもたいよ...", "おもいし、こわれてるよ...", "キレイにして...", "よごれているし、こわれているよ...", "よごれているし、おもたいよ...", "いっしょにいたくないの..."},
	{"いいです。", "早めに修理が肝心です", "過剰な負荷は不調の元ですよ", "負荷が大きすぎます　早めの改善を", "常に清潔を保ちましょう", "修理と清掃をしておくべきでしょう", "清掃と負荷の軽減をすべきかと", "考えうる限り最悪の状態です"},
	{"いい感じです！", "壊れています！", "重たいです！", "重たいし壊れています！", "汚れています！", "汚れているし壊れています！", "汚れているし重たいです！", "改善を希望します！"},
	{"いいね！", "早く直してもらえます？", "重いんでどいてもらえます？", "早くどいて直してください。", "早く拭いてもらえます？", "早く拭いて直してください。", "早くどいて拭いてください。", "早く改善してください。"},
	{"いい！", "壊れた！", "重い！", "重いし壊れてる！", "汚い！", "汚いし壊れてる！", "汚いし重い！", "最悪！"},
	{"い、いい感じです...", "壊れています...", "重たいです...", "降りて直してほしいです...", "掃除してほしいです...", "直して掃除してほしいです..", "降りて掃除してほしいです...", "改善していただけますでしょうか..."},
	{"ま、いいんじゃない？", "直してくれてもいいんだよ？", "重さを自覚してよね", "重いってば！　直して！", "拭いてくれてもいいんだけど", "早く綺麗にして直してよね", "重いってば！　早く拭いてよ", "なんとかしてって言ってるでしょ！"},
	{"いいね〜", "こわれたね〜", "重いね〜", "このままだと重さで壊れるね〜", "掃除の時間かな〜", "掃除して修理かな〜", "重たいからどいたあと掃除かな〜", "全部ダメだね〜"},
	{"いい感じ〜", "壊れちゃったみたい〜", "重いかも〜", "痛いし疲れたかも〜", "汚れちゃったみたい〜", "汚れちゃったし痛いかも〜", "汚れちゃったし重いかも〜", "う〜ん無理そう〜"},
	{"よいです。", "直してもらえると…", "休憩がしたいです…", "修理と休憩をお願いしたいです…", "そろそろお手入れしません…？", "修理とお手入れをお願いしたいです…", "お手入れと休憩をお願いしたいです…", "全体的になんとかして欲しいです…"},
	{"いい感じです！", "壊れています。", "重たいです。", "重たいし壊れています。", "汚れています。", "汚れているし壊れています。", "汚れているし重たいです。", "改善を希望します。"},
	{"いい感じ！", "直して！", "重いしどいて！", "座ってないで直して！", "汚れたし拭いて！", "拭いたり直したりして！", "座ってないで掃除して！", "全部改善してね！"},
	{"いいぜ！", "ボロボロになっちった！", "つっかれた！！！", "ボロボロのヘロヘロ！", "うわ、ドロドロだ！", "ドロドロのボロボロ！", "ドロドロのヘロヘロ！", "ドロドロのボロボロのヘロヘロだ！　なんとかしてくれ！"},
	{"いい感じです！", "故障も勲章！", "この体重でも支えてみせる！", "この重さ、壊れた状況で耐えられるか...？", "汚れているが耐えられる！", "ホコリにまみれボロボロになってもまだやれる...", "ホコリまみれでもこの重さ、支えられるか...?", "この状況はさすがに無理です..."},
	{"いい感じだよ〜", "壊れちゃった！", "重たーい！", "重いし壊れてる！", "汚れちゃった！", "汚れてるし壊れちゃった！", "汚れてるし重たーい！", "改善！改善！"},
	{"よいです。", "修理が必要です", "休息が必要です", "修理と休息が必要です", "清掃が必要です", "修理と清掃が必要です", "清掃と休息が必要です", "修理と清掃と休息が必要です"},
	{"いいよ！", "壊れちゃった！", "重いからどけたいな！", "はやくどいてなおしてよ！", "よごれたままなら暴れちゃうぞ！", "はやくなおしてキレイにしてよ！", "はやくどいてキレイにしてよ！", "改善しないなら座らせない！"},
}
